{
    "list": [
      {
        "name": "Kathryn Jarrett",
        "starCount": 5,
        "content": "Verawood Construction completed a small project in our home in summer 2024. The scope of the work was to replace the old acoustical ceiling tiles in our basement with something more modern, refresh the lighting throughout, and build a new look. Very happy with the results.",
        "title": "Home Owner"
      },
      {
        "name": "Kenneth",
        "starCount": 5,
        "content": "We contracted with Verawood Construction Ltd for our ensuite bathroom renovation involving the replacement of the shower, faucets, vanity, sink, toilet, tile flooring and tile shower walls plus bathroom accessories. Jim provided exceptional service, and the results exceeded our expectations.",
        "title": "Home Owner"
      },
      {
        "name": "Petra",
        "starCount": 5,
        "content": "We recently had Verawood renovate 3 bathrooms and install a 3 piece bathroom in our basement. From the beginning of this project, we knew we were in good hands. Jim, Jenna, Stephane, Erich and their whole team were professional, honest, and meticulous. Highly recommended.",
        "title": "Home Owner"
      },
      {
        "name": "Claire Raymond",
        "starCount": 5,
        "content": "Reliable and professional. I had the floor of my balcony redone, and I am very happy with the result. The team delivered exactly what they promised.",
        "title": "Home Owner"
      },
      {
        "name": "Andrew Thomson",
        "starCount": 5,
        "content": "We had Verawood come in and remove a load bearing wall for us. The entire experience from initial contact to final completion was exceptional and a refreshing departure from what we’re used to when dealing with contractors. The finished product is fantastic.",
        "title": "Home Owner"
      },
      {
        "name": "Hetal & Farhaan Thobani",
        "starCount": 5,
        "content": "Verawood did the build-out for a renovation in our home and did an incredible job. The work was done on time, priced fairly, and completed with integrity. Count on these guys for all construction and renovations!",
        "title": "Home Owners"
      },
      {
        "name": "M tan",
        "starCount": 5,
        "content": "Jim and Jenna went over and beyond to help me renovate! Thank you for making a house my home. Their team is truly amazing and attentive.",
        "title": "Home Owner"
      },
      {
        "name": "Carbon Conscious",
        "starCount": 5,
        "content": "Highly organized team and great communication. Verawood Construction made the renovation process seamless and stress-free.",
        "title": "Home Owner"
      }
    ]
  }
  
  
  
  
  
  